<?php
/**
 * _parts/footer.tpl.php
 * @author mgng
 */
?>

<div id="footer">
	<p class="copyright"><?= date("Y", $now_timestamp) ?> <?= h($base_title) ?></p>
</div>

<hr />

<!--
<p>
「Review」と言っていますが、どちらかといえば視聴記録で基本聴いたら全部「Review」を残してもらい、
気が向いたら文字のレビューも書く、くらいに使ってほしいと思っています。
（ツイッターの「○○聴いてる」みたいなのが、まとまって全部残っていて、他の人のも見れる、のようなイメージです。）
</p>

<p>
音楽をアルバム単位で扱います。これについてはそれでいいと思っています。
AppleMusicやGooglePlayの該当アルバムに直で行けといいと思います。
「Review」を残したらtwitterに自動で上がるのもいいかと思います。
</p>

<p>
ユーザはとりあえず50～100人くらいの音楽関係の友達などを想定しています。
つまり、みんな何聴いてるかちょっと系統立てて知りたいのです…。
</p>

<p>
ユーザ同士の関連性は今中途半端に同じfavorite trackなどをカウントしていますが、
聴いたタイミングに関係した何か面白い基準があるといいなと思っています。
syncreviewっていう名前はそのあたりを目指しての名前です。
この部分、今ボロボロの実装が入っています！これを書いていて「こりゃあかん」と思って、ムグさんに連絡した次第です…。
gracenoteやgoogleAPIの辺りとかも地獄のようなソースコードになってます。仕様を救出して焼き払ってください（笑）。
</p>
-->
